from db import DB


def main():
    db = DB("db.db")
    db.create_tables()
    
    while True:
        print("\n1. Додати нового студента")
        print("2. Додати новий курс")
        print("3. Показати список студентів")
        print("4. Показати список курсів")
        print("5. Зареєструвати студента на курс")
        print("6. Показати студентів на конкретному курсі")
        print("7. Вийти")

        choice = input("Оберіть опцію (1-7): ")

        if choice == "1":
            # Додавання нового студента     
            

        elif choice == "2":
            # Додавання нового курсу    

        elif choice == "3":
            # Показати список студентів
        
        elif choice == "4":
            # Показати список курсів

        elif choice == "5":

            # Зареєструвати студента на курс

        elif choice == "6":
            # Показати студентів на конкретному курсі
        
        elif choice == "7":
            break

        else:
            print("Некоректний вибір. Будь ласка, введіть число від 1 до 7.")
    



if __name__ == "__main__":
    main()
